from selenium import webdriver
# driver = webdriver.Chrome()

# a = [0,1,2,3,4,5]
# print(a[4:])
# print(a[:-1])

# a = [i for i in range(0, 5) if i > 2]
b = ['948851967',
     '733392547',
     '1279130678',
     '796578533',
     '36491106',
     '555621168',
     '55047751',
     '869330315',
     '793582474',
     '1619305148',
     '972739335',
     '1399600991',
     '991543721',
     '34426669',
     '963539816',
     '291073014',
     '948851967',
     '733392547',
     '950579789',
     '1279130678',
     '818943344',
     '591001465',
     '841961195',
     '1511273728',
     '515120494',
     '1171898558',
     '21192349',
     '257644953',
     '36728078',
     '875465827',
     '5673409',
     '314651644',
     ]
# print(a)
print(b)
#
# test_v = {}
# test_v['cap'] = 1
count = 0
while count < 5:
    count += 1
    judge_tag = 0
    a = input('请输入item_id:')
    for ii in b:
        if a == ii:
            print('itemid {} 在数组里'.format(a))
            judge_tag = 1
            break
    if judge_tag == 0:
        print('itemid {} 不在数组里'.format(a))
